{"keras_version": "1.2.2", "config": [{"config": {"name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa+D:\\SelfDriveND\\Behaviorial Cloning\\model.py\u00da\b<lambda>\u0017\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape": [66, 200, 3], "function_type": "lambda", "trainable": true, "arguments": {}}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "activation": "relu", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "trainable": true, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "activation": "relu", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "trainable": true, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_3", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "activation": "relu", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "trainable": true, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_4", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "nb_col": 3, "trainable": true, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_5", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "nb_col": 3, "trainable": true, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "input_dim": 1152, "init": "glorot_uniform", "output_dim": 1164, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "input_dim": 1164, "init": "glorot_uniform", "output_dim": 100, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "input_dim": 100, "init": "glorot_uniform", "output_dim": 50, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.1}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "input_dim": 50, "init": "glorot_uniform", "output_dim": 10, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_5", "W_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "input_dim": 10, "init": "glorot_uniform", "output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}