{"config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "output_shape": [66, 200, 3], "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa+D:\\SelfDriveND\\Behaviorial Cloning\\model.py\u00da\b<lambda>\u0017\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "border_mode": "valid", "nb_filter": 36, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "border_mode": "valid", "nb_filter": 48, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 1164, "trainable": true, "init": "glorot_uniform", "input_dim": 1152}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.4}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform", "input_dim": 1164}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform", "input_dim": 100}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.1}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "input_dim": 50}}, {"class_name": "Dense", "config": {"name": "dense_5", "b_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "init": "glorot_uniform", "input_dim": 10}}], "keras_version": "1.2.2", "class_name": "Sequential"}